// Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.

// Например, задан массив:

// 1 4 7 2

// 5 9 2 3

// 8 4 2 4

// 5 2 6 7

// Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка


int[,] arr = new int[4, 4];

int minSum = int.MaxValue;
int minSumInd = -1;
int numberRow = 0;

void RandomArray()
{
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        for (int j = 0; j < arr.GetLength(1); j++)
        {
            arr[i, j] = new Random().Next(0, 10);
        }
    }
}
void PrintArray()
{
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        for (int j = 0; j < arr.GetLength(1); j++)
        {
            Console.Write(arr[i, j] + " ");
        }
        Console.WriteLine();
    }
}
void SumArray()
{
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        int sum = 0;
        for (int j = 0; j < arr.GetLength(1); j++)
        {
            sum += arr[i, j];
        }
        if (sum < minSum)
        {
            minSum = sum;
            minSumInd = i;
            numberRow = i+1;
        }
    }
}
void PrintEndArray()
{
    Console.Write($"Строка {numberRow} с наименьшей суммой элементов: ");
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        Console.Write(arr[minSumInd, i] + " ");
    }
}

RandomArray();
PrintArray();
SumArray();
PrintEndArray();
